AGWebApp/app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT "roles".* FROM "roles"